# Pandas Training Notebook (Sales Dataset Theme)

This notebook teaches the fundamentals and advanced features of **Pandas** using a dummy **Sales dataset**.
Each concept is explained with markdown and demonstrated with practical examples.

### Objectives
1. Understand Pandas Series and DataFrames
2. Learn to read/write data
3. Perform data inspection, selection, and cleaning
4. Apply grouping, merging, and aggregation
5. Prepare data for real-world AI/ML pipelines

## 1. Import Libraries

In [27]:
import pandas as pd
import numpy as np

print("Pandas Version:", pd.__version__)
print("NumPy Version:", np.__version__)

Pandas Version: 2.2.3
NumPy Version: 2.1.3

## 2. Creating Dummy Sales Dataset

In [28]:
# Create a dummy sales dataset
data = {
    'Product_ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    'Product_Name': ['Laptop', 'Mouse', 'Keyboard', 'Monitor', 'Headphones', 'Printer', 'Tablet', 'Camera', 'Smartphone', 'Speaker'],
    'Category': ['Electronics', 'Accessories', 'Accessories', 'Electronics', 'Accessories', 'Electronics', 'Electronics', 'Electronics', 'Electronics', 'Accessories'],
    'Price': [70000, 1200, 2500, 15000, 2000, 10000, 25000, 30000, 40000, 3500],
    'Quantity': [5, 50, 40, 10, 35, 7, 15, 8, 12, 25],
    'Discount(%)': [10, 5, 5, 8, 10, 15, 7, 10, 12, 5]
}

df = pd.DataFrame(data)
df['Revenue'] = df['Price'] * df['Quantity'] * (1 - df['Discount(%)']/100)
df.head()

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue
0,101,Laptop,Electronics,70000,5,10,315000.0
1,102,Mouse,Accessories,1200,50,5,57000.0
2,103,Keyboard,Accessories,2500,40,5,95000.0
3,104,Monitor,Electronics,15000,10,8,138000.0
4,105,Headphones,Accessories,2000,35,10,63000.0

## 3. Reading and Writing Data

In [29]:
# Save and reload dataset as CSV
df.to_csv("sales_data.csv", index=False)
sales = pd.read_csv("sales_data.csv")
sales.head()

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue
0,101,Laptop,Electronics,70000,5,10,315000.0
1,102,Mouse,Accessories,1200,50,5,57000.0
2,103,Keyboard,Accessories,2500,40,5,95000.0
3,104,Monitor,Electronics,15000,10,8,138000.0
4,105,Headphones,Accessories,2000,35,10,63000.0

## 4. Data Inspection

In [30]:
sales.head()

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue
0,101,Laptop,Electronics,70000,5,10,315000.0
1,102,Mouse,Accessories,1200,50,5,57000.0
2,103,Keyboard,Accessories,2500,40,5,95000.0
3,104,Monitor,Electronics,15000,10,8,138000.0
4,105,Headphones,Accessories,2000,35,10,63000.0

In [31]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product_ID    10 non-null     int64
 1   Product_Name  10 non-null     object
 2   Category      10 non-null     object
 3   Price         10 non-null     int64
 4   Quantity      10 non-null     int64
 5   Discount(%)   10 non-null     int64
 6   Revenue       10 non-null     float64
dtypes: float64(1), int64(4), object(2)
memory usage: 692.0+ bytes

In [32]:
sales.describe(include='all')

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue
count,10.00000,10,10,10.000000,10.00000,10.000,10.000000
unique,NaN,10,2,NaN,NaN,NaN,NaN
top,NaN,Laptop,Electronics,NaN,NaN,NaN,NaN
freq,NaN,1,6,NaN,NaN,NaN,NaN
mean,105.50000,NaN,NaN,19920.000000,20.70000,8.700,179777.500000
std,3.02765,NaN,NaN,22125.591015,15.88885,3.335,136815.708594
min,101.00000,NaN,NaN,1200.000000,5.00000,5.000,57000.000000
25%,103.25000,NaN,NaN,2750.000000,8.50000,5.500,68031.250000
50%,105.50000,NaN,NaN,12500.000000,13.50000,9.000,116500.000000
75%,107.75000,NaN,NaN,28750.000000,32.50000,10.000,290250.000000
max,110.00000,NaN,NaN,70000.000000,50.00000,15.000,422400.000000

## 5. Selecting, Indexing, and Filtering

In [39]:
# Select a single column
(sales['Product_Name']=="Laptop")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Product_Name, dtype: bool

In [40]:
sales.index[sales['Product_Name'] == "Laptop"].tolist()

[0]

In [34]:
#if we have to find the what are the unique and how many unique value in the data set 
print(sales["Product_Name"].unique())
print(sales["Product_Name"].nunique())

['Laptop' 'Mouse' 'Keyboard' 'Monitor' 'Headphones' 'Printer' 'Tablet'
 'Camera' 'Smartphone' 'Speaker']
10

In [ ]:
df

In [8]:
# Select multiple columns
sales[['Product_Name', 'Price', 'Revenue']].head()

  Product_Name  Price   Revenue
0       Laptop  70000  315000.0
1        Mouse   1200   57000.0
2     Keyboard   2500   95000.0
3      Monitor  15000  138000.0
4   Headphones   2000   63000.0

In [46]:
# Filter data: products with revenue > 200000
sales[sales['Revenue'] > 200000]

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue
0,101,Laptop,Electronics,70000,5,10,315000.0
6,107,Tablet,Electronics,25000,15,7,348750.0
7,108,Camera,Electronics,30000,8,10,216000.0
8,109,Smartphone,Electronics,40000,12,12,422400.0

In [47]:
# Finding Top 4
sales[sales['Revenue'] > 200000].sort_values(by="Revenue",ascending =True  ).head(3)

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue
7,108,Camera,Electronics,30000,8,10,216000.0
0,101,Laptop,Electronics,70000,5,10,315000.0
6,107,Tablet,Electronics,25000,15,7,348750.0

## 6. Adding and Removing Columns

In [10]:
# Add new column: Profit = Revenue * 0.2
sales['Profit'] = sales['Revenue'] * 0.2
sales.head()

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue,Profit
0,101,Laptop,Electronics,70000,5,10,315000.0,63000.0
1,102,Mouse,Accessories,1200,50,5,57000.0,11400.0
2,103,Keyboard,Accessories,2500,40,5,95000.0,19000.0
3,104,Monitor,Electronics,15000,10,8,138000.0,27600.0
4,105,Headphones,Accessories,2000,35,10,63000.0,12600.0

In [11]:
# Remove column
sales = sales.drop(columns=['Discount(%)'])
sales.head()

   Product_ID Product_Name     Category  Price  Quantity   Revenue   Profit
0         101       Laptop  Electronics  70000         5  315000.0  63000.0
1         102        Mouse  Accessories   1200        50   57000.0  11400.0
2         103     Keyboard  Accessories   2500        40   95000.0  19000.0
3         104      Monitor  Electronics  15000        10  138000.0  27600.0
4         105   Headphones  Accessories   2000        35   63000.0  12600.0

## 7. Handling Missing Data

In [17]:
# Introduce missing values
print(sales.isna().sum())
print("---------duplicated--------")
print(sales.duplicated().sum())

Product_ID      0
Product_Name    0
Category        0
Price           0
Quantity        0
Discount(%)     0
Revenue         0
dtype: int64
---------duplicated--------
0

In [14]:
# Fill missing values with mean
sales['Price'].fillna(sales['Price'].mean(), inplace=True)
sales['Quantity'].fillna(sales['Quantity'].median(), inplace=True)
sales.isna().sum()

C:\Users\dell\AppData\Local\Temp\ipykernel_6528\2005129486.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  sales['Price'].fillna(sales['Price'].mean(), inplace=True)
C:\Users\dell\AppData\Local\Temp\ipykernel_6528\2005129486.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  sales['Quantity'].fillna(sales['Quantity'].median(), inplace=True)

Product_ID      0
Product_Name    0
Category        0
Price           0
Quantity        0
Revenue         0
Profit          0
dtype: int64

## 8. Detecting and Removing Duplicates

In [19]:
sales = sales.drop_duplicates()
print("duplicates:", sales.shape)

duplicates: (10, 7)

## 9. Sorting and Ranking

In [20]:
# Sort by Revenue descending
sales.sort_values(by='Revenue', ascending=False).head()

,Product_ID,Product_Name,Category,Price,Quantity,Discount(%),Revenue
8,109,Smartphone,Electronics,40000,12,12,422400.0
6,107,Tablet,Electronics,25000,15,7,348750.0
0,101,Laptop,Electronics,70000,5,10,315000.0
7,108,Camera,Electronics,30000,8,10,216000.0
3,104,Monitor,Electronics,15000,10,8,138000.0

In [25]:
# Rank products by Revenue
sales['Revenue_Rank'] = sales['Revenue'].rank(ascending=False)
sales[['Product_Name', 'Revenue', 'Revenue_Rank']]

  Product_Name   Revenue  Revenue_Rank
0       Laptop  315000.0           3.0
1        Mouse   57000.0          10.0
2     Keyboard   95000.0           6.0
3      Monitor  138000.0           5.0
4   Headphones   63000.0           8.0
5      Printer   59500.0           9.0
6       Tablet  348750.0           2.0
7       Camera  216000.0           4.0
8   Smartphone  422400.0           1.0
9      Speaker   83125.0           7.0

## 10. GroupBy and Aggregation

In [52]:
# Total revenue per category
category_revenue = sales.groupby('Category')['Revenue'].sum().reset_index()
# .sum().reset_index()
category_revenue

      Category    Revenue
0  Accessories   298125.0
1  Electronics  1499650.0

## 11. Merging and Concatenating DataFrames

In [19]:
# Create new DataFrame for merging
discount_info = pd.DataFrame({
    'Category': ['Electronics', 'Accessories'],
    'Avg_Discount': [10, 6]
})
merged = pd.merge(sales, discount_info, on='Category', how='left')
merged.head()

,Product_ID,Product_Name,Category,Price,Quantity,Revenue,Profit,Revenue_Rank,Avg_Discount
0,101,Laptop,Electronics,70000.000000,5.0,315000.0,63000.0,3.0,10
1,102,Mouse,Accessories,1200.000000,50.0,57000.0,11400.0,10.0,6
2,103,Keyboard,Accessories,21855.555556,40.0,95000.0,19000.0,6.0,6
3,104,Monitor,Electronics,15000.000000,10.0,138000.0,27600.0,5.0,10
4,105,Headphones,Accessories,2000.000000,35.0,63000.0,12600.0,8.0,6

## 12. Applying Functions and Lambda

In [53]:
# Apply lambda to categorize revenue
sales['Performance'] = sales['Revenue'].apply(lambda x: 'High' if x > 200000 else 'Low')
sales[['Product_Name', 'Revenue', 'Performance']]

  Product_Name   Revenue Performance
0       Laptop  315000.0        High
1        Mouse   57000.0         Low
2     Keyboard   95000.0         Low
3      Monitor  138000.0         Low
4   Headphones   63000.0         Low
5      Printer   59500.0         Low
6       Tablet  348750.0        High
7       Camera  216000.0        High
8   Smartphone  422400.0        High
9      Speaker   83125.0         Low

## 13. Real-World Example: Cleaning and Preparing Sales Data

In [21]:
# Clean final dataset and export
sales.dropna(inplace=True)
sales.drop_duplicates(inplace=True)
sales.to_csv('cleaned_sales_data.csv', index=False)
sales.head()

,Product_ID,Product_Name,Category,Price,Quantity,Revenue,Profit,Revenue_Rank,Performance
0,101,Laptop,Electronics,70000.000000,5.0,315000.0,63000.0,3.0,High
1,102,Mouse,Accessories,1200.000000,50.0,57000.0,11400.0,10.0,Low
2,103,Keyboard,Accessories,21855.555556,40.0,95000.0,19000.0,6.0,Low
3,104,Monitor,Electronics,15000.000000,10.0,138000.0,27600.0,5.0,Low
4,105,Headphones,Accessories,2000.000000,35.0,63000.0,12600.0,8.0,Low

## 14. Summary
In this notebook, we covered:
- Creating and manipulating Pandas DataFrames
- Cleaning and transforming data
- Performing aggregation and merging operations
- Exporting cleaned datasets for ML and analytics workflows

**Next Step:** Use Matplotlib and Seaborn to visualize this data in the next notebook.

# Pandas Function Summary Table

| **Category** | **Function** | **Purpose / Why We Use It** | **How to Apply (Example)** |
|---------------|---------------|------------------------------|-----------------------------|
| ** Basic Data Info** | `df.head(n)` | View first *n* rows (default 5) | `df.head(10)` |
| | `df.tail(n)` | View last *n* rows | `df.tail(5)` |
| | `df.info()` | Get summary (columns, datatypes, nulls) | `df.info()` |
| | `df.shape` | Get number of rows & columns | `df.shape`  (rows, columns) |
| | `df.columns` | Show column names | `df.columns` |
| | `df.describe()` | Summary stats (mean, std, etc.) | `df.describe()` |
| ** Selection & Filtering** | `df['col']` | Select one column | `df['Price']` |
| | `df[['col1','col2']]` | Select multiple columns | `df[['Price','Quantity']]` |
| | `df.loc[row_label, col_label]` | Label-based selection | `df.loc[0,'Price']` |
| | `df.iloc[row_idx, col_idx]` | Index-based selection | `df.iloc[0,2]` |
| | `df[df['col'] > value]` | Filter rows | `df[df['Revenue'] > 50000]` |
| | `df[df['col']=='value']` | Filter by category | `df[df['Category']=='Electronics']` |
| ** Sorting** | `df.sort_values(by='col')` | Sort ascending by column | `df.sort_values(by='Revenue')` |
| | `df.sort_values(by='col', ascending=False)` | Sort descending | `df.sort_values(by='Revenue', ascending=False)` |
| ** Aggregation / Grouping** | `df.groupby('col').sum()` | Sum per group | `df.groupby('Category')['Revenue'].sum()` |
| | `df.groupby('col').mean()` | Average per group | `df.groupby('Category')['Price'].mean()` |
| | `df.groupby('col').count()` | Count per group | `df.groupby('Category')['Product'].count()` |
| | `df.groupby('col').agg({'col1':['sum','mean']})` | Multiple aggregations | `df.groupby('Category').agg({'Revenue':['sum','mean']})` |
| ** Adding / Modifying Columns** | `df['NewCol'] = ...` | Create new column | `df['Revenue'] = df['Price']*df['Qty']` |
| | `df['col'].apply(func)` | Apply custom function | `df['Price'].apply(lambda x: x*1.18)` |
| | `df['col'].map(dict)` | Map values | `df['Category'].map({'A':1,'B':2})` |
| ** Missing Data Handling** | `df.isnull()` | Check missing values | `df.isnull().sum()` |
| | `df.fillna(value)` | Fill missing values | `df['Price'].fillna(0)` |
| | `df.dropna()` | Drop missing rows | `df.dropna()` |
| ** Duplicates** | `df.duplicated()` | Check duplicates | `df.duplicated()` |
| | `df.drop_duplicates()` | Remove duplicate rows | `df.drop_duplicates()` |
| ** Mathematical & Statistical** | `df['col'].sum()` | Sum of a column | `df['Revenue'].sum()` |
| | `df['col'].mean()` | Average | `df['Revenue'].mean()` |
| | `df['col'].max()` | Max value | `df['Revenue'].max()` |
| | `df['col'].min()` | Min value | `df['Revenue'].min()` |
| | `df['col'].rank()` | Rank data | `df['Revenue'].rank(ascending=False)` |
| ** Merging & Joining** | `pd.concat([df1,df2])` | Combine DataFrames vertically | `pd.concat([sales1,sales2])` |
| | `pd.merge(df1, df2, on='key')` | Combine DataFrames horizontally | `pd.merge(products, sales, on='Product_ID')` |
| ** Index & Reset** | `df.set_index('col')` | Set a column as index | `df.set_index('Product_ID')` |
| | `df.reset_index()` | Reset index back to default | `df.reset_index()` |
| ** Exporting / Importing** | `pd.read_csv('file.csv')` | Load data from CSV | `pd.read_csv('sales.csv')` |
| | `df.to_csv('file.csv', index=False)` | Save DataFrame to CSV | `df.to_csv('output.csv', index=False)` |
| | `pd.read_excel('file.xlsx')` | Load Excel | `pd.read_excel('sales.xlsx')` |
| | `df.to_excel('file.xlsx', index=False)` | Export to Excel | `df.to_excel('report.xlsx', index=False)` |
| **Others / Utility** | `df.value_counts()` | Count unique values | `df['Category'].value_counts()` |
| | `df.unique()` | Unique values in a column | `df['Category'].unique()` |
| | `df.nunique()` | Number of unique values | `df['Category'].nunique()` |
| | `df.sample(n)` | Randomly pick rows | `df.sample(5)` |
| | `df.sort_index()` | Sort by index | `df.sort_index()` |